Revit 2027 API
FailuresAccessor.IsTransactionBeingCommitted Method
 Checks if the transaction for which failures are processed is being committed or rolled back.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsTransactionBeingCommitted()
Public Function IsTransactionBeingCommitted As Boolean
public:
bool IsTransactionBeingCommitted()
member IsTransactionBeingCommitted : unit -> bool
Return Value
Boolean
 True if current transaction is being committed, false if the transaction is being rolled back.
Exceptions
Exception | Condition
InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing).
Remarks
 A transaction is considered as "being committed" if a caller has requested the transaction to be committed and no previous failure processing operation requested the transaction to be rolled back.
See Also
Reference
FailuresAccessor Class
Autodesk.Revit.DB Namespace